* Java
** DONE [#C] Jnativehook is awesome library for cross-platform hook. :JAVA:NOTE:
CLOSED: [2016-10-08 Sat 13:56]
CLOCK: [2016-07-21 Thu 18:44]--[2016-07-21 Thu 18:45] =>  0:01
** DONE [#C] using var = Math.max(var1,var2) instead of if(var1>var2) { var=var1} :NOTE:
CLOSED: [2016-10-08 Sat 15:34]
CLOCK: [2016-08-23 Tue 10:05]--[2016-08-23 Tue 10:14] =>  0:09
** DONE inputstream to byte java                                      :NOTE:
CLOSED: [2016-10-09 Sun 01:09]
CLOCK: [2016-10-01 Sat 18:07]--[2016-10-01 Sat 18:08] =>  0:01
#+BEGIN_SRC java
      public static final byte[] toBytes(InputStream inputStream) throws IOException {
          ByteArrayOutputStream baos = new ByteArrayOutputStream();
          byte[] bytes = new byte[4096];
          int len;
          while ((len = inputStream.read(bytes,0,4096))!=-1){
              baos.write(bytes,0,len);
          }
          return baos.toByteArray();
      }
#+END_SRC
** DONE StringBuilder append if single char using append(char c)   java :NOTE:
CLOSED: [2016-10-09 Sun 01:10]
CLOCK: [2016-10-01 Sat 20:03]--[2016-10-01 Sat 20:03] =>  0:00
** DONE Not capturing group regex java                                :NOTE:
CLOSED: [2016-10-09 Sun 01:10]
CLOCK: [2016-10-01 Sat 21:16]--[2016-10-01 Sat 21:18] =>  0:02
?:
http://stackoverflow.com/questions/3512471/what-is-a-non-capturing-group
** DONE gradle task only be executed once                             :NOTE:
CLOSED: [2016-10-09 Sun 01:10]
CLOCK: [2016-10-01 Sat 22:23]--[2016-10-01 Sat 22:23] =>  0:00
** DONE Continuing the build when a failure occurs in order to discover more error gradle :NOTE:
CLOSED: [2016-10-09 Sun 01:10]
CLOCK: [2016-10-01 Sat 22:30]--[2016-10-01 Sat 22:31] =>  0:01
